Revit 2024 API
Room.ClosedShell Property
Return the closedShell of the Room.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public GeometryElement ClosedShell { get; }
Visual Basic
Public ReadOnly Property ClosedShell As GeometryElement
	Get
Visual C++
public:
property GeometryElement^ ClosedShell {
	GeometryElement^ get ();
}
See Also
Room Class
Autodesk.Revit.DB.Architecture Namespace